config.org
#+title: Emacs configuration
#+author: Giovani Pedroso
#+LANGUAGE:  en
#+OPTIONS: toc:3

* Table of content :toc:
- [[#todo][TODO]]
- [[#dependecies][Dependecies]]
  - [[#lsp-bridge][Lsp-bridge]]
- [[#basic-keybind-to-edit-the-orgmode][Basic keybind to edit the orgmode]]
- [[#basic-configurations][Basic configurations]]
  - [[#use-package-package-manager][Use-package (Package manager)]]
  - [[#elpaca-package-manager---not-in-use][Elpaca (Package manager) - Not in use]]
  - [[#straightel-package-manager---not-in-use][Straight.el (Package manager) - Not in use]]
  - [[#basic-interface-change][Basic interface change]]
- [[#keybinds][Keybinds]]
  - [[#general---package-to-maneger-the-keybinds---need-to-change-to-my-taste][General - Package to maneger the keybinds - Need to change to my taste]]
- [[#aperence][Aperence]]
  - [[#all-the-icons][All the icons]]
  - [[#doom-themes][Doom themes]]
  - [[#doom-mode-line][Doom mode line]]
  - [[#fonts---disable][Fonts - Disable]]
  - [[#nerd-icons][Nerd icons]]
  - [[#page-breaking][Page breaking]]
- [[#funcional][Funcional]]
  - [[#buffer-move---allow-to-move-the-buffer-to-other-split-windows][Buffer move - Allow to move the buffer to other split windows]]
  - [[#centaur-tabs---tab-for-emacs][Centaur-tabs - Tab for Emacs]]
  - [[#dashboard][Dashboard]]
  - [[#diminish---allow-to-hide-modes-from-the-mode-line][Diminish - Allow to hide modes from the mode line]]
  - [[#evil-mode---vim-keybinds-for-emacs][Evil mode - vim keybinds for emacs]]
  - [[#helpful---better-help-messages][Helpful - Better help messages]]
  - [[#ivy---disabled---autocompletion-for-the-minibuffer][Ivy - DISABLED - Autocompletion for the minibuffer]]
  - [[#rainbow-mode][Rainbow mode]]
  - [[#org-mode][Org mode]]
  - [[#projectile][Projectile]]
  - [[#sudo-edit---must-be-fix---allow-to-edit-files-as-super-user][Sudo edit - MUST BE FIX - Allow to edit files as super user]]
  - [[#vertigo---autocompletion-for-the-minibuffer][Vertigo - Autocompletion for the minibuffer]]
  - [[#which-key---give-descrito-keybinds][Which key - Give descrito keybinds]]
- [[#programing][Programing]]
  - [[#yasnippet---it-must-be-the-first-to-load][YASnippet - It must be the first to load]]
  - [[#company---package-that-give-completion-function-to-emacs][Company - Package that give completion function to Emacs]]
  - [[#formating][Formating]]
  - [[#fly---checkes-the-syntax-of-the-code][FLY - checkes the syntax of the code]]
  - [[#lsp-mode---it-makes-emacs-an-ide][lsp-mode - it makes emacs an IDE]]
  - [[#lsp-bridge---it-makes-emacs-an-ide---not-working-yet][lsp-bridge - it makes emacs an IDE - Not working YET]]
  - [[#mode-for-languages][Mode for languages]]
- [[#sources][Sources]]

* TODO

+ See how to set a leader key for emacs
+ Change the keybind for the yasnippets
+ Chage the keybinds for the markdown mode

* Dependecies 

Some packages require so additional programs to run

** Lsp-bridge

run the command:

#+begin_src shell
pip3 install epc orjson sexpdata six setuptools paramiko rapidfuzz 
#+end_src

This package also need the packages: markdown-mode, yasnippet they will the install later

Then clone the git repositori for the package in my case I cloned in a folder called aur in the home directory you can do than use the command: 

#+begin_src shell
git clone https://github.com/manateelazycat/lsp-bridge.git ~/aur/lsp-bridge
#+end_src

* Basic keybind to edit the orgmode

+ C-X C-e -> eval a block of code
+ M-C-\ -> auto ident the blocks of code
+ C-c C-, -> show some things to add in the orgmode file 

* Basic configurations
** Use-package (Package manager) 

Configure the origins on the packages and installs the use-package, this package is a better way to install package that the vanilla emacs package manager

#+begin_src emacs-lisp
  ;;Verify and initialize the package.el
  (require 'package)
  ;;Define the repos
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org"   . "https://orgmode.org/elpa/")
                           ("elpa"  . "https://elpa.gnu.org/packages/")))

  ;;Init the package system
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;;Installs the use-package
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

*** Update the packages at 21:00


#+begin_src emacs-lisp
  ;; Instalação do auto-update
  (use-package auto-package-update

    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "21:00"))

#+end_src

** Elpaca (Package manager) - Not in use

+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.6)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                   ((zerop (call-process "git" nil buffer t "clone"
                                         (plist-get order :repo) repo)))
                   ((zerop (call-process "git" nil buffer t "checkout"
                                         (or (plist-get order :ref) "--"))))
                   (emacs (concat invocation-directory invocation-name))
                   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                         "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                   ((require 'elpaca))
                   ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
#+end_src

*** Enable use-package support

+begin_src emacs-lisp
  ;; Install a package via the elpaca macro
  ;; See the "recipes" section of the manual for more details.

  ;; (elpaca example-package)

  ;; Install use-package support
  (elpaca elpaca-use-package
          ;; Enable :elpaca use-package keyword.
          (elpaca-use-package-mode)
          ;; Assume :elpaca t unless otherwise specified.
          (setq elpaca-use-package-by-default t))

  ;; Block until current queue processed.
  (elpaca-wait)

  ;;When installing a package which modifies a form used at the top-level
  ;;(e.g. a package which adds a use-package key word),
  ;;use `elpaca-wait' to block until that package has been installed/configured.
  ;;For example:
  ;;(use-package general :demand t)
  ;;(elpaca-wait)

  ;; Expands to: (elpaca evil (use-package evil :demand t))

  ;;Turns off elpaca-use-package-mode current declaration
  ;;Note this will cause the declaration to be interpreted immediately (not deferred).
  ;;Useful for configuring built-in emacs features.
  (use-package emacs :elpaca nil :config (setq ring-bell-function #'ignore))

  ;; Don't install anything. Defer execution of BODY
  ;; (elpaca nil (message "deferred"))
#+end_src

** Straight.el (Package manager) - Not in use


+ To update the packages use: M-x
+ To delete unuse packages use: M-x straight-remove-unused-repos

*** Install the straight

+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
          "straight/repos/straight.el/bootstrap.el"
          (or (bound-and-true-p straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;;Use use-package insted of straight-use-package
  (straight-use-package 'use-package)

  ;; Automatic use :ensure in all packages
  (setq straight-use-package-by-default t)
#+end_src

** Basic interface change

#+begin_src emacs-lisp
  ;;remove o initial buffer
  (setq inhibit-tar.up-message t)

  ;;Hide the tool bar
  (tool-bar-mode   -1)

  ;;Hide the menu bar
  (menu-bar-mode   -1)                 

  ;;Oculta dicase
  (tooltip-mode    -1)                 

  ;;Disable the scroll bar
  (scroll-bar-mode -1)                

  ;;Show the column number in the modeline
  (column-number-mode t)              

  ;;Self closing ()  [] ""
  (electric-pair-mode 1)

  ;;Enable the highlight line
  (global-hl-line-mode t)

  (kill-buffer)                            

  ;;Set the lines on in the relative mode
  (setq display-line-numbers-type 'relative) 
  (global-display-line-numbers-mode)

  ;;Disable the suspend frame
  (global-unset-key (kbd "C-z"))

  (delete-selection-mode t) 

  ;;disable num lines for the modes:
  (dolist (mode '(org-mode-hook
                  vterm-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                 eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  ;;Smoth scroll
  (setq mouse-wheel-scroll-amount '(8 ((shift) . 1)) 
        mouse-wheel-progressive-speed nil            
        mouse-wheel-follow-mouse 't                  
        scroll-step 1)                               

  ;;Broke line
  (global-visual-line-mode t)

  ;;Space in the boards
  (set-fringe-mode 0)

  ;;Cursor type
  (setq-default cursor-type 'box)

  (setq backup-directory-alist `(("." . "~/.saves")))
#+end_src

* Keybinds
