config.el

;;Get the a random image to show on the dashboard
(defun get-random-image()
  ;;Set the  directory of the images
  (setq-local directory-images "~/Pictures/Emacs-dashboard/to-show/")
  ;;Put in a list all images in the directory
  (setq-local images (directory-files directory-images nil ".png"))

  ;;Join the folder's path with the image path
  ;;and return the full path
  (concat directory-images
          ;;get a random image
          (nth (- (random (length images)) 1) images)
          ))

(use-package dashboard
  :ensure t
  :init
  (progn;;This execult commands in the initialization process
    (setq dashboard-banner-logo-title "Quem desiste não cansa")
    (setq dashboard-set-init-info nil)
    (setq dashboard-startup-banner (get-random-image))
    (setq dashboard-set-heading-icons t)

    ;; Content is not centered by default. To center, set
    ;;This variable to t
    (setq dashboard-center-content t)
    (setq dashboard-set-file-icons t)
    ;;(setq dashboard-footer-messages '("Better than VSCoiso"))
    (setq dashboard-items '(
                            ;;(agenda . 4)
                            ;;(recents  . 6)
                            (bookmarks . 6)
                            (projects . 4)
                            ))
    )

  :config
  (dashboard-setup-startup-hook))

(use-package diminish
  :ensure t
  )

(use-package evil
:ensure t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-below-right t)
  (evil-mode)
  )

(use-package evil-collection
  :ensure t
  :after evil
  :config
  (setq evil-collection-mode-list '(dashboard dired ibuffer))
  (evil-collection-init)

;; Set key bind to comment lines
  (space-leader
    "g c" '(evilnc-comment-or-uncomment-lines :wk "Comment line"))
  )

(use-package evil-tutor :ensure t )

;;Motion keys
(define-key evil-normal-state-map "n" 'evil-next-visual-line)
(define-key evil-normal-state-map "e" 'evil-previous-visual-line)
(define-key evil-normal-state-map "i" 'evil-forward-char)
(define-key evil-normal-state-map "m" 'evil-backward-char)

(define-key evil-visual-state-map "n" 'evil-next-line)
(define-key evil-visual-state-map "e" 'evil-previous-line)
(define-key evil-visual-state-map "i" 'evil-forward-char)
(define-key evil-visual-state-map "m" 'evil-backward-char)

(define-key evil-visual-state-map "l" 'evil-insert)
(define-key evil-visual-state-map "y" 'evil-yank)
(define-key evil-visual-state-map "o" 'evil-open-below )
(define-key evil-visual-state-map "O" 'evil-open-above )

;;Motion keys
;;Functions keys
(define-key evil-normal-state-map "l" 'evil-insert)
(define-key evil-normal-state-map "y" 'evil-yank)
(define-key evil-normal-state-map "o" 'evil-open-below )
(define-key evil-normal-state-map "O" 'evil-open-above )

;;(global-set-key (kbd "g c") 'evilnc-comment-or-uncomment-lines)

(global-set-key (kbd "C-c <tab>") 'yas-expand)

(use-package helpful
  :ensure t
  :config
  (space-leader
   "h" '(:ignore t :wk "Help")
   "h k" '(helpful-key :wk "Help keybind")
   "h c" '(helpful-callable :wk "Help function")
   "h v" '(helpful-variable :wk "Help variable"))
  )

(use-package rainbow-mode
  :ensure
  :hook org-mode prog-mode
  )

(defun efs/org-mode-setup ()
   (org-indent-mode)
   (variable-pitch-mode 1)
   (visual-line-mode 1))
 ;;Automatic display images in the orgmode
 (setq org-startup-with-inline-images t)
 (use-package org
   :pin org
   :commands (org-capture org-agenda)
   :hook
(org-mode . efs/org-mode-setup)
(org-mode . org-toggle-inline-images)
  )

(defun efs/org-mode-visual-fill ()
  (setq visual-fill-column-width 120
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . efs/org-mode-visual-fill))

(with-eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))
  (push '("conf-unix" . conf-unix) org-src-lang-modes))

;;   Set faces for heading levels
(dolist (face '((org-level-1 . 1.4)
                (org-level-2 . 1.3)
                (org-level-3 . 1.2)
                (org-level-4 . 1.1)
                (org-level-5 . 1.1)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1)))
  (set-face-attribute (car face) nil :font "Monospace" :weight 'regular :height (cdr face)))

;; Ensure that anything that should be fixed-pitch in Org files appears that way
(set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
(set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
(set-face-attribute 'line-number nil :inherit 'fixed-pitch)
(set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch)

(setq org-startup-folded t)
(setq org-startup-indented t)
(setq org-startup-with-inline-images t)
(use-package org-bullets
  :ensure t
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●"))
  )

(use-package org-superstar
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))

(electric-indent-mode -1)

(use-package toc-org
  :ensure
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))

(add-hook 'org-mode-hook 'org-indent-mode)
(use-package org-bullets :ensure)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

(with-eval-after-load 'org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("cpp" . "src cpp"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"));
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("js" . "src js"))
  ;;C doenst work yet
  ;;(add-to-list 'org-structure-template-alist '("c" . "src C"))
  )
;;remove the massage ask you to exec the command
(setq org-confirm-babel-evaluate nil)

(use-package projectile 
  :ensure
  :config
  (projectile-mode 1) 
  )
