config.el

(use-package sudo-edit
  :ensure t
  :config
  (space-leader
   "f s" '(:ignore t :wk "Sudo with files")    
   "f s f" '(sudo-edit-find-file :wk "Sudo find file")
   "f s e" '(sudo-edit :wk "Sudo edit file"))
  )

(use-package vertico
:init
(vertico-mode)
;; Different scroll margin
;; (setq vertico-scroll-margin 0)
;; Show more candidates
;; (setq vertico-count 20)
;; Grow and shrink the Vertico minibuffer
;; (setq vertico-resize t)
;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
;; (setq vertico-cycle t)
)

;; Optionally use the `orderless' completion style. See
;; `+orderless-dispatch' in the Consult wiki for an advanced Orderless style
;; dispatcher. Additionally enable `partial-completion' for file path
;; expansion. `partial-completion' is important for wildcard support.
;; Multiple files can be opened at once with `find-file' if you enter a
;; wildcard. You may also give the `initials' completion style a try.
(use-package orderless
:init
;; Configure a custom style dispatcher (see the Consult wiki)
;; (setq orderless-style-dispatchers '(+orderless-dispatch)
;;       orderless-component-separator #'orderless-escapable-split-on-space)
(setq completion-styles '(orderless)
read-buffer-completion-ignore-case t
completion-category-defaults nil
completion-category-overrides '((file (styles partial-completion)))))

;; Persist history over Emacs restarts. Vertico sorts by history position.
(use-package savehist
:init
(savehist-mode))
;; A few more useful configurations...
(use-package emacs
:init
;; Add prompt indicator to `completing-read-multiple'.
;; Alternatively try `consult-completing-read-multiple'.
(defun crm-indicator (args)
(cons (concat "[CRM] " (car args)) (cdr args)))
(advice-add #'completing-read-multiple :filter-args #'crm-indicator)

;; Do not allow the cursor in the minibuffer prompt
(setq minibuffer-prompt-properties
'(read-only t cursor-intangible t face minibuffer-prompt))
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

;; Emacs 28: Hide commands in M-x which do not work in the current mode.
;; Vertico commands are hidden in normal buffers.
;; (setq read-extended-command-predicate
;;       #'command-completion-default-include-p)

;; Enable recursive minibuffers
(setq enable-recursive-minibuffers t))

(use-package which-key
  :ensure
  :init
  (which-key-mode 1)
  :config
  (setq which-key-side-window-location 'bottom
        which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 6
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-idle-delay 0.8
        which-key-max-description-length 25
        which-key-allow-imprecise-window-fit nil
        which-key-separator " → " ))

(use-package company
  :ensure t
  :diminish
  :after
  lsp-mode
  :hook
  (lsp-mode . company-mode)
  :bind
  (:map company-active-map
        ("<tab>" . company-select-next))
  ;;(:map lsp-mode-map
  ;;      ("<tab>" . company-select-next))
;;:config
;;(define-key company-active-map (kbd "<tab>") 'company-select-next)
  :custom
  (company-begin-commands '(self-insert-command))
  (company-idle-delay .1)
  (company-minimum-prefix-length 1)
  (company-show-numbers t)
  (company-tooltip-align-annotations 't)
  (global-company-mode t))

(use-package company-box
  :ensure t
  :after company
  :diminish
  :hook (company-mode . company-box-mode))

(use-package prettier
  :ensure t
  :hook
  ((mhtml-mode json-mode css-mode ts-mode scss-mode rjsx-mode js2-mode web-mode) . prettier-mode))

(use-package flycheck
  :ensure t
  :defer t
  :diminish ;; Does not show in the mode line as a mode
  :init (global-flycheck-mode))

(use-package lsp-mode
  :ensure t
  :commands
  ;;Activate the package when this functions are called
  (lsp lsp-deferred)
  :hook
  (lsp-mode . efs/lsp-mode-setup)
  ;;Init lsp for the modes:
  (c-mode . lsp-deferred)
  (c-mode . lsp-deferred)
  (csharp-mode . lsp-deferred)
  (c++-mode . lsp-deferred)
  (rust-mode . lsp-deferred)
  ;;(typescript-mode . lsp-deferred)
  (css-mode . lsp-deferred)
  (scss-mode . lsp-deferred)
  (svelte-mode . lsp-deferred)
  (dockerfile-mode . lsp-deferred)
  (yaml-mode . lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-l")  ;; Or 'C-l', 's-l'
  :config
  (setq lsp-log-io nil);;don't log everthing = speed
  ;;Sometimes the lsp stop for no reason
  ;;this will restart it
  (setq lsp-restart 'auto-restart)
  ;;Give the presscription of
  ;;the keys pressed using the
  ;;which-key packge
  (lsp-enable-which-key-integration t))

;;Avoid the lsp breaks the emacs
(setq gc-cons-threshold 10000000)
(setq read-process-output-max (* 1024 1024))



(use-package dockerfile-mode :ensure t)

;; json-mode
(use-package json-mode
  :ensure t)

(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown")
  :bind (:map markdown-mode-map
         ("C-c C-e" . markdown-do)))

(use-package python-mode
  ;; It's already installed
  :ensure nil
  :hook 
  (python-mode . lsp-deferred)
:config 
  (programming-bindins
   "p" '(:ignore t :wk "Python")
   "p s" '(switch-to-buffer :wk "Opens a python shell"))

  ;;:hook (python-mode . lsp-deferred)
  ;; NOTE: Set these if Python 3 is called "python3" on your system!
  ;; (python-shell-interpreter "python3")
  ;; (dap-python-executable "python3")
  ;;(dap-python-debugger 'debugpy)
  ;;:config
  ;;(require 'dap-python)
  )

(use-package rust-mode
  :ensure t)

(use-package svelte-mode
  :ensure t
  )

(use-package typescript-mode
:mode "\\.ts\\'"
:hook
;;Start the lsp when the enter in the type script mode
(typescript-mode . lsp-deferred)
:config
(setq typescript-indent-level 2)
;;Installs the dap for node applications
(require 'dap-node)
(dap-node-setup))
