config.org
*** Web mode - mode for html, ts, tsx, js, svelte, etc

#+begin_src emacs-lisp
  (setq-default tab-width 2)
  (setq indent-tabs-mode nil)
  (defun luke/webmode-hook ()
    "Webmode configurations."
    (setq web-mode-enable-comment-annotation t)
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-code-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-attr-indent-offset 0)
    (setq web-mode-enable-auto-indentation t)
    (setq web-mode-enable-auto-closing t)
    (setq web-mode-enable-auto-pairing t)
    (setq web-mode-enable-css-colorization t)
    )
  (use-package web-mode
    :ensure t
    :mode (;;("\\.js\\'" . web-mode)
           ("\\.jsx\\'" . web-mode)
           ("\\.js\\'" . web-mode)
           ;;("\\.ts\\'" . web-mode)
           ;;("\\.tsx\\'" . web-mode)
           ("\\.svelte\\'" . web-mode)
           ;;Was confiliting with lsp
           ;;("\\.css\\'" . web-mode)
           ("\\.html\\'" . web-mode))
    :commands web-mode
    :hook
    (web-mode . luke/webmode-hook)
    (web-mode . lsp-deferred)
    )
#+end_src

*** Yalm mode

#+begin_src emacs-lisp
  (use-package yaml-mode
    :ensure t
    )
#+end_src 

* Sources

To make this config file I used:

+ [[https://www.youtube.com/watch?v=d1fgypEiQkE&list=PL5--8gKSku15e8lXf7aLICFmAHQVo0KXX&index=2][DistroTube emacs tutorials]]
+ [Systemcrafters tutorials]]
